read_verilog "hw/rtl/core.v"
hierarchy -top tiny1_core
opt; fsm; opt
synth
write_verilog synth.v
