read_verilog "core.v"
read_verilog "regfile.v"
hierarchy -top cpu
opt; fsm; opt
synth
write_verilog synth.v